Revit 2026 API

# RouteAnalysisSettingsAnalysisZoneTopOffset Property

---

The top plane offset, in ft, for the zone used in route calculation. Default value is 6'8".

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double AnalysisZoneTopOffset { get; set; }
```
```vb
Public Property AnalysisZoneTopOffset As Double
	Get
	Set
```
```cpp
public:
property double AnalysisZoneTopOffset {
	double get ();
	void set (double value);
}
```
```fsharp
member AnalysisZoneTopOffset : float with get, set
```

#### Property Value

Double

| Exception | Condition |
| --- | --- |
| ArgumentOutOfRangeException | When setting this property: The given value for topOffset must be non-negative. |

The zone's top plane elevation is different per plan view and is determined by adding the top offset to the view's level elevation.

#### Reference

RouteAnalysisSettings Class

Autodesk.Revit.DB.Analysis Namespace